tutorials/multiphase/vof/vofSolver/laminar/waves/waveFlumeObject/system/topoSetDict
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell; 
        sourceInfo
         {
            box ( 10 -0.2 -0.1 ) ( 10.25 0.05 0.2 ) ;
         }
    }
    {
        name    c0;
        type    cellSet;
        action  invert;
        source  ; 
        sourceInfo
         {
            ;
         }
    }
);

// ************************************************************************* //
